leobenaducci/smart-home-bot/services/home-cameras/esp32/camera-server/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//
// Modified for home-stack: derived from the CameraWebServer example in
// Espressif's arduino-esp32 (see NOTICE in this directory).
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

#include "esp_system.h"  // esp_restart()

// ---------------------------------------------------------------------------
// Frame-grab watchdog
// ---------------------------------------------------------------------------
// A camera spent four hours answering /status instantly — reading sensor
// registers correctly over SCCB, so the chip was alive and addressable — while
// every single frame grab failed: /capture 500'd after ~4 s and /stream
// accepted the connection and then sent nothing at all, for ever. A power
// cycle did not clear it.
//
// Nothing in this firmware noticed. There is no remote restart either: the
// only ESP.restart() lives in the WiFi-config /save handler, which is
// unreachable once the camera is on the network. So the only recovery was
// walking to the camera and pulling its power, and the only way anyone found
// out was a person looking at a frozen tile.
//
// Count consecutive grab failures; rebuild the driver after a few; reboot if
// even that does not take. A camera that cannot produce a frame is broken in a
// way it is perfectly capable of noticing by itself.
//
// The counter is deliberately consecutive, not cumulative: an occasional
// dropped frame under load is normal and must never accumulate into a reboot.
static const int FB_FAILS_BEFORE_RECOVER = 10;
static const int FB_FAILS_BEFORE_RESTART = 40;

extern bool cameraRecover();  // in the .ino, where the camera config lives

static volatile int s_consecutive_fb_failures = 0;

// esp_camera_fb_get() with the accounting attached. Every frame grab in this
// file goes through here so there is one place that knows whether the camera
// is actually working.
static camera_fb_t *camera_fb_get_watched() {
  camera_fb_t *fb = esp_camera_fb_get();
  if (fb) {
    s_consecutive_fb_failures = 0;
    return fb;
  }

  int fails = ++s_consecutive_fb_failures;
  log_e("Camera capture failed (%d in a row)", fails);

  if (fails >= FB_FAILS_BEFORE_RESTART) {
    // Re-initialising did not bring it back. Out of ideas that do not involve
    // a person, and a reboot is the one thing left that this can do alone.
    log_e("Camera still dead after %d failures and a driver rebuild; rebooting", fails);
    esp_restart();
  }

  if (fails == FB_FAILS_BEFORE_RECOVER) {
    // On the exact count, not every failure past it: rebuilding the driver is
    // disruptive, and the grabs that follow need a chance to succeed before
    // anything decides it did not work.
    if (cameraRecover()) {
      s_consecutive_fb_failures = 0;
      log_w("Camera driver rebuilt after %d failed grabs", fails);
    } else {
      log_e("Camera driver rebuild failed");
    }
  }

  return NULL;
}

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  fb = camera_fb_get_watched();
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

